In [1]:
from pydataset import data

In [2]:
titanic = data('titanic')
titanic

          class     age    sex survived
1     1st class  adults    man      yes
2     1st class  adults    man      yes
3     1st class  adults    man      yes
4     1st class  adults    man      yes
5     1st class  adults    man      yes
...         ...     ...    ...      ...
1312  3rd class   child  women       no
1313  3rd class   child  women       no
1314  3rd class   child  women       no
1315  3rd class   child  women       no
1316  3rd class   child  women       no

[1316 rows x 4 columns]

In [3]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1316 entries, 1 to 1316
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   class     1316 non-null   object
 1   age       1316 non-null   object
 2   sex       1316 non-null   object
 3   survived  1316 non-null   object
dtypes: object(4)
memory usage: 51.4+ KB

In [4]:
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [5]:
#uma forma de se obter o número de sobreviventes
survivor=0
nonsurvivor=0
for people in titanic["survived"]:
    if people == 'yes':
        survivor = survivor + 1
    else:
        nonsurvivor= nonsurvivor + 1

print("Número de sobreviventes:{}  Número de mortos:{}".format(survivor,nonsurvivor))

Número de sobreviventes:499  Número de mortos:817

In [6]:
#utilizando o método .value_couts()

In [7]:
titanic['survived'].value_counts()

no     817
yes    499
Name: survived, dtype: int64

In [8]:
titanic['class'].value_counts()

3rd class    706
1st class    325
2nd class    285
Name: class, dtype: int64

In [9]:
titanic[['class','survived']].value_counts()

class      survived
3rd class  no          528
1st class  yes         203
3rd class  yes         178
2nd class  no          167
1st class  no          122
2nd class  yes         118
dtype: int64

In [10]:
ps_1class = float(203/325)
pm_3class = float(528/706)

print(f'percentual de sobreviventes da primeira classe: {ps_1class:.2%}')
print(f'percentual de mortos da terceira classe: {pm_3class:.2%}')

percentual de sobreviventes da primeira classe: 62.46%
percentual de mortos da terceira classe: 74.79%

In [25]:
#outra maneira de se resolver
fclass = titanic[titanic["class"]=='1st class']             
fclass = fclass.drop(["class","age","sex"],axis=1)
sfclass = fclass[fclass["survived"]=='yes']

percentual_spc = sfclass.count()/fclass.count()
percentual_spc

survived    0.624615
dtype: float64

In [27]:
tclass = titanic[titanic["class"]=='3rd class']             
tclass = tclass.drop(["class","age","sex"],axis=1)
mtclass = tclass[tclass["survived"]=='no']

percentual_mtc = mtclass.count()/tclass.count()
percentual_mtc

survived    0.747875
dtype: float64